Repository: tamariam/Progress-Tracker
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ga

source: MeathDigital
ga: MeathDigitigh

source: Meath County Council logo
ga: Lógó Chomhairle Contae na Mí

source: Strategy
ga: Straitéis

source: Themes
ga: Téamaí

source: Accessibility Statement (opens in a new tab)
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: Accessibility
ga: Cosúil.

source: Disclaimer Statement (opens in a new tab)
ga: Cosúil .

source: Disclaimer
ga: Cosúil

source: Privacy Statement (opens in a new tab)
ga: Cosúil

source: Inactive
ga: Neamhghníomhach

source: In progress
ga: Ar siúl

source: Completed
ga: Críochnaithe

source: Actions for Digital <br>Transformation
ga: Gníomhartha don Chlaochliú Digiteach

source: Scroll Down
ga: Scrollaigh Síos

source: Our Digital & ICT Strategy
ga: Ár Straitéis Dhigiteach & TFC

source: Driving digital innovation and transformation for all <strong>Meath County Council</strong> services.
ga: Ag cur nuálaíocht agus claochlú digiteach chun cinn do gach seirbhís de chuid Chomhairle Contae na Mí.

source: Evolving Expectations
ga: Ionchais ag Athrú

source: Expectations for what IT should deliver have risen exponentially over the last decade. Technology has fundamentally changed how we interact, raising the bar for how Meath County Council engages with citizens as a public service body.
ga: Tá ionchais maidir leis an méid is féidir le TF a sholáthar tar éis méadú go mór thar an deich mbliana seo caite..

source: Our Digital Strategy
ga: Ár Straitéis Dhigiteach

source: The Meath County Council Digital and ICT Strategy is an ambitious roadmap to harness technology's potential. Following 4 main themes-Digital Services, Workforce, Systems, and Communities-it helps us modernise and improve our services.
ga: Is léarscáil uaillmhianach í Straitéis Dhigiteach agus TFC Chomhairle Contae na Mí chun acmhainneacht na teicneolaíochta a ghiaráil...

source: People at the Centre
ga: Daoine sa Lár

source: We are committed to putting people at the core of our processes. This ensures all services are simple, integrated, seamless, and accessible. We aim to deliver services digitally while still offering essential in-person and alternate channels to ensure we leave no one behind.
ga: Táimid tiomanta daoine a chur i gcroílár ár bpróiseas...

source: To achieve our goal, our ambitious strategy is divided into the following key metrics:
ga: Chun ár sprioc a bhaint amach, roinntear ár straitéis isteach i méadrachtaí lárnacha...

source: Objectives
ga: Cuspóirí

source: Actions
ga: Gníomhartha

source: digital services
ga: seirbhísí digiteacha

source: digital workforce
ga: lucht oibre digiteach

source: digital systems
ga: córais dhigiteacha

source: digital communities
ga: pobail dhigiteacha

source: Celebrating past achievements
ga: Ag Ceiliúradh na mBaiteach Róimhe Seo

source: This section summarises a selection of Digital and ICT projects delivered during the Council Term <strong>2019-2024.</strong>
ga: Tugann an rannóg seo achoimre ar thionscadail Dhigiteacha agus TFC a seoladh idir 2019–2024.

source: website
ga: Suíomh Gréasáin

source: Website
ga: Suíomh Gréasáin

source: In partnership with Corporate, in 2019 a totally redeveloped, customer-centric and responsive website was launched. In the last 12 months alone there have been over 371,000 unique visitors to the site and approximately 1.3 million page views! A substantial programme of work was also undertaken to ensure ongoing accessibility compliance on our website.
ga: I gcomhpháirt leis an gCorparáid, seoladh suíomh gréasáin athfhorbartha agus freagrúil in 2019..

source: consultation portal
ga: Tairseach Chomhairliúcháin

source: Consultation Portal
ga: Tairseach Chomhairliúcháin

source: There has been a strong focus on the use of our online consultation portal consult.meath.ie/en/ with the County Development Plan and Meath’s Digital Strategy being the first major consultations on the portal. The portal has over 5,700 registered users and since June 2019, the Council have published 184 consultations, 10 corporate surveys and 12 application forms.
ga: Bhí fócas láidir ar úsáid ár dtairseach chomhairliúcháin ar líne...

source: CRM website
ga: Réiteach CRM Fiontraíochta

source: Enterprise CRM solution
ga: Bhí ról lárnach ag an bhfoireann TF i soláthar agus cur i bhfeidhm an chórais CRM nua...

source: The IT team played a pivotal role in the successful procurement, implementation and rollout of a new Corporate Enterprise CRM. This supports back office administrative functions, analytical dashboards, and a Portal for Elected Members. Between Jan 2019 and September 2025 there have been over 240,000 cases processed through the CRM.
ga: Córas Faisnéise Geografaí (GIS)

source: GIS website
ga: Córas Faisnéise Geografaí (GIS)

source: GIS
ga: Córas Faisnéise Geografaí (GIS)

source: Projects delivered by the GIS team include:
ga: Córas Faisnéise Geografaí (GIS)

source: significant assistance on the 2021-2027 County Development Plan (CDP) including interactive mapping portfolio for public display.
ga: Córas Faisnéise Geografaí (GIS)

source: 4,569 RZLT land parcels digitised with automated site assessment reports.
ga: Córas Faisnéise Geografaí (GIS)

source: spatial reporting services for all departments
ga: Córas Faisnéise Geografaí (GIS)

source: authentication
ga: henticatio

source: There has been a continuous focus on cyber security including enhancements to network infrastructure, SOC\SIEM, vulnerability and patch management, network penetration testing, email validation, web filtering, cyber security awareness initiatives and the creation of the Information Security Committee to oversee Meath County Councils Cyber Security posture.
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: Home office
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: As with all organisations we had to quickly adapt to agile working arrangements in a very short timeframe, and the IT department played a key role in ensuing business continuity within the Council and to ensuring delivery of services to the public. This included remote working arrangements, adoption of video conferencing to support remote meetings, increased staff support and managing additional security risks.
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: Selection of Services
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: The provision of numerous solutions including:
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: The rollout of the national ePlanning Portal
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: Healthy Age Friendly Shared Services.
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: Mobile solutions facilitating thousands of inspections across multiple departments in the Council.
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: technology
ga: Cosúil .

source: Modernisation of Services
ga: Cosúil le gach

source: Continued modernisation of processes, technology, devices, operating systems, and software within the Council. This includes but is not limited to implementing and installing a new Hyperconverged infrastructure to replace legacy SAN, virtual environment and backup technology..
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: Scroll to top
ga: Cosúil le gach.

source: Action
ga: Cosúil

source: Description
ga: CosúilCosúil

source: Details
ga: CosúilCosúil

source: No update recorded yet.
ga: Cosúil CosúilCosúil

source: ← Back
ga: Cosúil

source: Loading...
ga: Cosúil

source: Please wait while content loads...
ga: Cosúil CosúilCosúil Cosúil CosúilCosúil

source: Error loading content. Please try again.
ga: Cosúil CosúilCosúil Cosúil CosúilCosúil

source: Loading Theme Details...
ga: Cosúil CosúilCosúil

source: Close Modal
ga: Cosúil

source: In line with Meath Digital's vision, goals and operational objectives, the following progress has been made in Digital Services:
ga: Cosúil CosúilCosúil

source: Actions Completed
ga: Cosúil CosúilCosúil

source: Actions In Progress
ga: Cosúil Cosúil Cosúil

source: Actions Not Started
ga: Cosúil

source: Objective
ga: Cosúil

source: Status
ga: Cosúil

source: There are no actions for this objective yet.
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.

source: No objectives found for this theme yet.
ga: Cosúil le gach eagraíocht eile, bhí orainn dul in oiriúint go tapa do shocruithe oibre solúbtha.
